#pragma		once

#include	"tonagraphic3_album.h"

namespace NT3
{

// ****************************************************************
// G00 をディブに読み込む
// ================================================================
bool load_g00_to_dib_expand(C_dib* dib, CTSTR& file_path, int cut_no);

// ****************************************************************
// G00 をアルバムに読み込む
// ================================================================
bool load_g00_to_album(C_album* album, CTSTR& file_path);

}
